<!-- APIを使わないサンプル -->

<!DOCTYPE html>

<head>
    <title>返信サンプル</title>
</head>

<body>

    <?php
    // 挨拶 ================================================================================================================================================
    $text = 'こんにちは';

    // 送られてきたメッセージに合わせて返事を変えている
    if ($text == 'おはよう') {
        $reply = 'おはようございます';
    } elseif ($text == 'こんにちは') {
        $reply = 'こんにちは';
    } elseif ($text == 'こんばんは') {
        $reply = 'こんばんは';
    }

    print('挨拶：' . $reply);
    print('<br><hr>');

    // おみくじ ================================================================================================================================================
    // おみくじの配列を準備
    $omikuji = ['大吉', '中吉', '小吉', '末吉', '吉', '凶', '大凶'];
    // array_rand関数でランダムに値を取得
    $result = $omikuji[array_rand($omikuji)];

    // おみくじの結果を出力
    print('おみくじ：' . $result);
    print('<br><hr>');

    // 数字あてゲーム ================================================================================================================================================

    // 送られてきたメッセージ
    $text = '10';
    // int型に変更
    $number = intval($text);
    // 解答は15
    $answer = 15;
    if ($number < $answer) {
        $reply = 'もっと大きい数だよ！';
    } elseif ($number > $answer) {
        $reply = 'もっと小さい数だよ！';
    } else {
        $reply = '正解！';
    }
    print('数字あてゲーム：' . $reply);


    ?>

</body>